{
  "panel": [
    {
      "tagline": "Our Journey Begins",
      "content": "Our intrepid heros awkwardly meet in a bar, shouting at each other and forming instantaneous lifelong friendships with each other. Oh-Pro has heard evil is afoot. Omaric is looking for someone who can't keep himself from exploding. The Hermit doesn't want anyone to talk to him but is fine talking to other people. Most shockingly of all, Clud *is*. Our hero's chat with the barkeep, and determine that the weirdness afoot is concentrated around either the tannery or the quarry. They head off to the quarry and after a brief discussion with the voluptuous troglodite that runs the joint, they determine that the quarry has already been cleared out. With a sigh and a resounding facepalm that seems to come from the heavens itself, the tread back to the bar. Oh-pro accidentally narrowly prevents a bar fight when The Hermit tries to... instigate a bar fight. The heros hit the road and after a caravan straight up refuses to let them guard it, they decide the best thing to do would be to search belliard for the missing delegation. After some argument over the names of roads, our hero's set out into the hills, camping for an evening on some rocky shale. The next morning they stumble upon a group that may or may not be the bandit party that hit the delegation, but I mean, what are the chances? After pretty much everyone gets to go spy on the apparently unsuspecting bandits, the party stand around and does nothing, until Oh-pro decides to walk up and say hello. Cue Pokemon battle music.",
      "id": 1
    },
    {
      "tagline": "I Challenge You to Mortal Combat!",
      "content": "Our intrepid adventurer's begin having already instigated a scuffle between themselves and some bandits in the sumber hills bandit x2 takes a shot at oh-pro and misses, cloak of billowing billows idiotically, but seems to repel arrows. Bandits approach oh-pro, clud whimpers in fear for his best buddy the bad guy throws a hailstorm at us, not realizing that I'm allergic to hail, clud and omaric fall to their dicks, but the hermit and oh-pro keep their feet The hermit gets up, slinks through the ice, and gahks one of the baddies. Clud contemplates how he can best help oh-pro because they are best buddies. He walks up and lashes out with his dagger/sword and more or less smites the baddie Omaric casts chromatic orbs at the baddies. He nails the head baddie Oh-pro walks out of the hailstorm, appearing in front of one of the medium level bandits, he holds his hand (sideways) up to the bandits face and unloads a magic missile. Two bandits take a cheap shot at oh-pro and actually manage to land hits! Another bandit takes a shot at clud who is hit. Both bestest friends are unfazed, their friendship burning hotter than the pains of their wounds. The head bandit fires an icicle at oh-pro, but he misses. The hermit continues to slink around and just absolutely mirk the living shit out of baddies One of them actually takes a shot at him which fails more or less spectacularly a bandit lvl 2 engages in mortal combat with oh-pro. Clud kind of wanders around the battlefield aimlessly. Eventually wanders up and shockingly grasps a baddie Omaric fades in and out of existence for a second, but when he comes too, he lashes out with his lightning lure and dagger at the vagrant scuffling with oh-pro Oh-pro casts word of radience which does suprisingly little, then slinks away, he takes an unbelievable 12 points of damage on the AoO. A bandit hits Omeric, and another aims but misses best buddy clud, who is accidentally dodging while rushing to the aid of his bestest buddy. The main baddie veils himself and moves into the fight The hermit continues to be an absolute unit. Kills another baddie and stabs ANOTHER one. The baddie doesn't die though and totally stabs back. Also smiles like a weirdo. CLUDS TURNS to help the last bandit that hurt his BESTEST BUDDY Oh-pro, and not to help the hermit like one might think. In a surprisingly adroit move, clud sidesteps the bandito and delivers a coup de grace. What a golem. Omaric moves up to face off with the big baddie, flinging spells left right and center nails the baddie with some spells and then rolls a 1 on the wild magic roullette. A roll of 51 gives him a spectral shield for the next minute. Oh-pro reflects on how poorly he chose his spells for a combat situation. He ends up just buffing the hermits constitution, in order to keep the murder machine topped off. Two guys go after Omaric and Clud and fail pretty miserably. The big bad finally makes it into the fray, casts magic missle at point blank range on clud the golem. ~~Interlude because Sam had to call his Grandpa. Omaric is doing 2 damage to someone. Oh-pro fire-bolts the big baddie and with 2 lucky rolls, he dies in an immolating inferno. With their leader dead, the bandits split in all directions, while oh-pro shouts out to his compatriots to try and not let all of them escape. Omeric and the hermit attempt to waylay one of the bandits, with the hermit flattening one of the evildoers. As if to make up for having to let one of his compatriots do literally anything, the hermit dashes after a bandit, though he whiffs. Clud has determined that the bandit the hermit tried to kill really needs to die. He throws his javalin and despite hitting, the bandit limps away...until Omeric follows up with coup de gras.  Oh-pro secures the unconcious bandit while Omaric and clud keep watch over him. The hermit and Oh-pro looooooooot the tents. Oh-pro finds 4 silver pieces and 1 set shitty clothes, the hermit on the other hand, finds 58 silver pieces. Omaric nat 20 interrogates the bandit. It turns out he is from the River Guard Keep which doesn't mean anything to any of us. they were gonna ambush a merchant train. turns out they're working for Olliver grimjaw who's some other guy at riverguard. It's south of our position. We untie him and let him go, but clud murders the shit out of him. Tired from a murder-spree and immolating/stabbing/poisoning our enemies, the party camps for the evening, ready to resume their trip to belliard on the next dawn, searching for the lost delegation.",
      "id": 2
    }
  ]
}