{
  "panel": [
    {
      "tagline": "Our Journey Begins",
      "content": "Our intrepid heros awkwardly meet in a bar, shouting at each other and forming instantaneous lifelong friendships with each other. Oh-Pro has heard evil is afoot. Omaric is looking for someone who can't keep himself from exploding. The Hermit doesn't want anyone to talk to him but is fine talking to other people. Most shockingly of all, Clud *is*. Our hero's chat with the barkeep, and determine that the weirdness afoot is concentrated around either the tannery or the quarry. They head off to the quarry and after a brief discussion with the voluptuous troglodite that runs the joint, they determine that the quarry has already been cleared out. With a sigh and a resounding facepalm that seems to come from the heavens itself, the tread back to the bar. Oh-pro accidentally narrowly prevents a bar fight when The Hermit tries to... instigate a bar fight. The heros hit the road and after a caravan straight up refuses to let them guard it, they decide the best thing to do would be to search belliard for the missing delegation. After some argument over the names of roads, our hero's set out into the hills, camping for an evening on some rocky shale. The next morning they stumble upon a group that may or may not be the bandit party that hit the delegation, but I mean, what are the chances? After pretty much everyone gets to go spy on the apparently unsuspecting bandits, the party stand around and does nothing, until Oh-pro decides to walk up and say hello. Cue Pokemon battle music.",
      "id": 1
    },
    {
      "tagline": "I Challenge You to Mortal Combat!",
      "content": "Our intrepid adventurer's begin having already instigated a scuffle between themselves and some bandits in the sumber hills bandit x2 takes a shot at oh-pro and misses, cloak of billowing billows idiotically, but seems to repel arrows. Bandits approach oh-pro, clud whimpers in fear for his best buddy the bad guy throws a hailstorm at us, not realizing that I'm allergic to hail, clud and omaric fall to their dicks, but the hermit and oh-pro keep their feet The hermit gets up, slinks through the ice, and gahks one of the baddies. Clud contemplates how he can best help oh-pro because they are best buddies. He walks up and lashes out with his dagger/sword and more or less smites the baddie Omaric casts chromatic orbs at the baddies. He nails the head baddie Oh-pro walks out of the hailstorm, appearing in front of one of the medium level bandits, he holds his hand (sideways) up to the bandits face and unloads a magic missile. Two bandits take a cheap shot at oh-pro and actually manage to land hits! Another bandit takes a shot at clud who is hit. Both bestest friends are unfazed, their friendship burning hotter than the pains of their wounds. The head bandit fires an icicle at oh-pro, but he misses. The hermit continues to slink around and just absolutely mirk the living shit out of baddies One of them actually takes a shot at him which fails more or less spectacularly a bandit lvl 2 engages in mortal combat with oh-pro. Clud kind of wanders around the battlefield aimlessly. Eventually wanders up and shockingly grasps a baddie Omaric fades in and out of existence for a second, but when he comes too, he lashes out with his lightning lure and dagger at the vagrant scuffling with oh-pro Oh-pro casts word of radience which does suprisingly little, then slinks away, he takes an unbelievable 12 points of damage on the AoO. A bandit hits Omeric, and another aims but misses best buddy clud, who is accidentally dodging while rushing to the aid of his bestest buddy. The main baddie veils himself and moves into the fight The hermit continues to be an absolute unit. Kills another baddie and stabs ANOTHER one. The baddie doesn't die though and totally stabs back. Also smiles like a weirdo. CLUDS TURNS to help the last bandit that hurt his BESTEST BUDDY Oh-pro, and not to help the hermit like one might think. In a surprisingly adroit move, clud sidesteps the bandito and delivers a coup de grace. What a golem. Omaric moves up to face off with the big baddie, flinging spells left right and center nails the baddie with some spells and then rolls a 1 on the wild magic roullette. A roll of 51 gives him a spectral shield for the next minute. Oh-pro reflects on how poorly he chose his spells for a combat situation. He ends up just buffing the hermits constitution, in order to keep the murder machine topped off. Two guys go after Omaric and Clud and fail pretty miserably. The big bad finally makes it into the fray, casts magic missle at point blank range on clud the golem. ~~Interlude because Sam had to call his Grandpa. Omaric is doing 2 damage to someone. Oh-pro fire-bolts the big baddie and with 2 lucky rolls, he dies in an immolating inferno. With their leader dead, the bandits split in all directions, while oh-pro shouts out to his compatriots to try and not let all of them escape. Omeric and the hermit attempt to waylay one of the bandits, with the hermit flattening one of the evildoers. As if to make up for having to let one of his compatriots do literally anything, the hermit dashes after a bandit, though he whiffs. Clud has determined that the bandit the hermit tried to kill really needs to die. He throws his javalin and despite hitting, the bandit limps away...until Omeric follows up with coup de gras.  Oh-pro secures the unconcious bandit while Omaric and clud keep watch over him. The hermit and Oh-pro looooooooot the tents. Oh-pro finds 4 silver pieces and 1 set shitty clothes, the hermit on the other hand, finds 58 silver pieces. Omaric nat 20 interrogates the bandit. It turns out he is from the River Guard Keep which doesn't mean anything to any of us. they were gonna ambush a merchant train. turns out they're working for Olliver grimjaw who's some other guy at riverguard. It's south of our position. We untie him and let him go, but clud murders the shit out of him. Tired from a murder-spree and immolating/stabbing/poisoning our enemies, the party camps for the evening, ready to resume their trip to belliard on the next dawn, searching for the lost delegation.",
      "id": 2
    },
    {
      "tagline": "I'm not Clud I'm his Cousin, Dulc",
      "content": "Oh-pro woke up from his long rest feeling strangely more useful than he was before! Off to beliard! The adventurer's head straight to The Watchful Knight. While nobody except clud is really attracting any looks, it's The Hermit's attempt to woo the bartender that really gathers attention. On quesitoning about the delegation, the bartender's eyes glance down the bar at \"shorter than average dark skinned wood elf\" Delegation was in town 10 days ago, stayed for a night. The leaders mentioned they were going to head south towards the desarian road. The actually female wood elf introduces herself (Esmerelda of the traveling folk) to clud, who like a prick, says that he isn't clud, but clud's cousin. After a brief dance, each adventurer each recieves a missive from the emerald enclave Elder circle, signed by Teresiel of the Abbey of Goldenfields. We each recieve 50 gold and a writ of inquiry. Noice. Talk to a guy who says he saw blue (WHITE) cloaks flying vultures. The more official sherrif guy (Halrud Ponden) corroborates this, we pump him for info, threaten him, and then leave. Cloak billowing. They camp near the edge of town and then take to strolling down the road, clud and oh-pro hand in hand, with the hermit shadowing them. Clud spots a murder of ravens, which obviously piques everyone's interest for a variety of reasons. Near the ravens we see the remnants of a battle, featuring bodies with red axe emblems (symbol of mirarbar). Truly chilling stuff. After scoping out the battlefiled, Omaric pokes a cairn which causes clud to hulk out on one. Inside the cairn are the bodies of some bug-bears, which are apparently like big goblins. They bear a triangle with a line in it (recognized as the black earth symbol). Looking around some tracks it's determined that whoever set up these cairns trekked off west after the battle. And West we head.",
      "id": 3
    },
    {
      "tagline": "Foo Fighters: Walk",
      "content": "\nWe follow the footprints west. Find boats, no hoes. Now we head south. Directions are so fun! We flag down a passing boat who offers to take us across the river. High Fives all around. On discussing looking for bandits, we realize that this guy is definitely up to no good, and trying to kidnap us. We maladroitly manage to distract him long enough to not get trapped in the castle harbor, and the hermit stabs him in the chest. At which point he actually hops in the water and swims away, instead of dying horribly. Eww. Our heros frantically paddle towards the shore and make it barely ahead of their pursuers. Oh-pro hucks a surprisingly large firebolt at the pursuing ship and actually manages to crack the hull. The riverguard hostiles turn around and row their shitty boat back home. After that we wander around, scoping out riverguard keep and determining that we are woefully under-equipped to siege a castle. We come upon a mas grave that makes us think that maybe the riverguard keep has something to do with the mirrabar delegation disappearance. This grave scoping thing really pays off of a lot for us. Omaric and Oh-pro knock on the front door while the hermit tries to sneak in. The hermit fails (probably because climbing a wall doesn't involve killing something) and oh-pro takes an arrow to the hit points while the Gatekeeper of Oz tells them repeatedly to go away. The group shrugs their shoulders and head back into the valley's where they see a spire and some more white coats flying hhither and thither. While trying to figure out how to infiltrate the tower, Clud remembers that he can make a laser cannon. Well shit.",
      "id": 4
    },
    {
      "tagline": "When One Door Closes, another Door Opens... and another... and another...",
      "content": "Firing a laser cannon at their castle gets the attention of.... the Feathergale knights, from feathergale spire, obviously. We meet Savra, Golgari queen, who after some coaxing, invites us for dinner. She doesn't seem to know anything about the miribar delegation, which is annoying as fuck. We get the cribs: feathergale spire tour. There, we meet Thrull (Thrule? Thrul? Therul?) Merosska who's built like a truck. Thrull apparently thinks that their role is peacekeepers in the area, but all they really do is freak people out with their soaring death birds. We retire to our room where Clud stands, staring at a wall. 4 seconds later its been determined that the best thing to do is to snoop. The Hermit goes low while Omaric and Oh-pro go high. The Hermit meets a stable hand who trades him a bow and otherwise just appears to be a generic (if not helpful) NPC. The Hermit goes to the Solarium as well, where he meets another npc. Meanwhile, Omaric and Oh-pro have learned the hideous, dark secret of the Feathergale Knights: They suck at their job. We do some further snooping at the one locked door aaaand.... actually find a letter that seems like it could be valuable. The hermit absconds with the interesting bits to show his compatriots, and only barely manages to return them to their positions while Oh-pro fakes a nervous breakdown. Then it's time for dinner!",
      "id": 5
    },
    {
      "tagline": "Nice Air Club",
      "content": "So there we were... at the hero's feast... celibrating the 10th year of the weathervale knights. Manticore's are bad news so we determine it is time for some murderkilling! After watching the manticore pretty graphically haul away some vulture riding bitch knights, the Squad gives chase. Clud gets the first crack at it and oh-pro follows up ineffectively (but with a billowing cloak!). Omaric accomplishes a drive by with his yu-gi-oh sounding lightsaber magic booming sword weapon thing aaaand misses the manticore. Holy shit the manticore has a ranged attack and it more or less murder-kills him in response. The Hermit does the thing that he does and shoots the manticore with his shiny new bow. While Clud and the hermit keep it busy, Oh-pro does cleric things to Omeric, and un-murders him. Omeric launches a ball of magic at the manticore, which is having a bad day. The manticore responds by turnning on best buddy, who easily evades its ranged (wtf) attack. The hermit obviously lands the killing blow and our intrepid animal killers haul it back to the spire. After a quick go-round to spray blood all over the people on top of the spire, the compadres land, the hermit gets the ring, and omg overall our respect for the weathervale knights is so low. Thrune, the last troll, tells us that there is a black monastary where the holders of the black earch symbol reside. Nobody could have seen that coming. The Hermit conducts a shockingly thorough interrogation of Thrune now that he's a dope monster hunter. Savra stops to talk to the hermit about \"mastering the element of air\" and asks if he wants to join the 'elemental air brotherhood'. Savra seems to be under some mental influence with trying to recruit us. Interesting. We tromp down and The Hermit opens the conversation with a ploy known as \"being a huge dick\" by calling the weathervale knights, \"an air club\". Damn. After a few more questions Clud just says what he's all thinking, \"can we just kill this guy?\"\n",
      "id": 6
    },
    {
      "tagline": "THE BOOOOOOOT",
      "content": "\"Can we just fucking kill him\"? And try to just fucking kill him we shall. Some initial scuffling and shifting leaves the hermit in the hallway 1v3 and the plant guy and 2 mooks stuck in a room with Omaric, Clud, and Oh-pro. Omaric bursts into a horrifying necrotic angel of horror which leaves... actually most of the people in the room non-plussed. Clud remembers that he can make self-propelled artillery and he produces a flamethrower that goes to work. The hermit attack rolls back into the room and his assailants quickly follow, only to get a faceful of Cluds-Flamethrower. Thrule, the last airbender flinches and in true Dnd fashion, it occurs to everyone that the adventurers could actually win this. Clud sits in the corner and beats on the plant guy, who seems like he's a spellcaster with dice that only count up to 4. Thrule beats the everloving shit out of Oh-pro and the hermit, but they manage to give almost as good as they get and this one is looking to be a squeaker. Bleeding what seems like \"a lot\", Oh-pro gathers a spell into his hands. He looks from the hermit's bloodied daggers to his bloody... everything, Oh-pro flings his last healing spell at the hermit, closing his wounds and invigorating him to Halo 3* this shit. Unimpressed, Thrule stabs Oh Pro and everyone resets their definition of what \"a lot\" of bleeding looks like. Clud cries out in absolute emotional agony. Falling to his knees, the only being Clud curses more than his creator (for not providing him tears for which to weep for his fallen buddy), is those that would take away the only being who made him feel like he had a real, live, beating, anatomically oversized heart. The sounds of his anguish echo through the halls of the tower and it none who hear it can help but stop and wonder what could have precipitated such sorrow from a being of literal stone. Anyways, The hermit pops in and makes with the stabby stab, but Thrule seems to be the first person we've met who doesn't a) die, and b) suck at stabbing back. The hermit suffers a deeeeeep cut but... he doesn't die. Omaric keeps turning his daggers into lightsabers but also keeps missing his attacks. Finally, drawing himself up to his not inconsiderable height, Clud, vows to take revenge on his current mortal enemy. He uses a spell (wtf?) to huck a paperweight, and then an old boot at Thrule, the last troll. To the surprise of the hermit, Omaric, probably Clud, and the blood-fountain-formerly-known-as-oh-pro, the paperweight staggers Thrule, and the Boot drives him to the floor. Clud's projectile curbstomp seems to have won the day. Oh, and Oh pro wasn't dead, he was mostly dead, and Omaric heals him enough to get him back on his feet and healing everyone else. Woo! Clud hugs his bestest buddy so hard that it's almost like he's trying to re-kill him. The music after you win a pokemon battle plays in the background as highfives are exchanged and Weathervale knights flee the tower like...well, like they suck. \n*Halo 3 tagline: Finish the fight\n",
      "id": 7
    },
    {
      "tagline": "Did you say \"Horsebugs\"?",
      "content": "\nAfter definitely taking a 10 minute rest, our intrepid hero's try and determine what to do next. They stare serenly out the window as bitch tits mcKnightswatch flee from every orifice. They find a bunch of shit so obviously it's shopping time. Oh-pro gets camping gear, a hammer, and armor. The hermit gets arrows and more murder kill things like arrows. Omaric gets daggers because that seems to be his thing. Idk if clud gets anything but the warm satisfaction of seeing his best friends happy. The intrepid troup trapeses towards the earth kingdom where they're acosted by giant acid spitting horse bugs. Oh pro heals people up, Clud nabs a flamethrower, and Omaric just hammers them with magic balls of death and bob's your uncle they are suuuuper dead. Nice.\n",
      "id": 8
    },
    {
      "tagline": "I dont know",
      "content": "Huh, so we find the flat earth society and we we're like \"hey, let us in\". They did not want too, likely because we accused them of murder and kidnapping. They did, however, want us to murderkill some waterbenders they had just sent away (people from the riverguard keep). We didn't... quite... agree to kill them, but we did go after them, finding them to be a tough bunch of idiots, led by the largest and most capable idiot, uncle gargas. We ask uncle gargas what they were doing and they told us they had been there to collect money for a job. Unfortunately, he didn't know how much he was supposed to get... and then he didn't get it anyways. His boss was going to be not happy. His brainless syncophants nodded in agreement. We dragged UG back to the flat earther monastary to try and figure out what the fuck happened. The hermit snuck into the monastary while our parties frustration mounted at nobody know anything about what was going on. Ugh. Clud got tired of this and started stabbing ripjaw rapter, which precipitated what most people would refer to as \"a brawl\". Obviously the huge amount of fire and death our team is able to bring to bear made medium work of Uncle Gargas and the lethal interjection crew. The details are unimportant, but there was definitely someone from the Earth Kingdom who knows their way around the pointy end of a daggar. That could become important.",
      "id": 9
    }
  ],
  "mapMarker": [
    {
      "description": "This is where our heroes met and Clud and Oh-pro became bestest friends",
      "yPos": 981,
      "xPos": 747,
      "id": 6
    },
    {
      "description": "this is about where we had our first bandit-fight and The hermit/Omaric smoked some noobs, with Clud showing himself to be suprisingly bloodthirsty for something with no blood",
      "yPos": 906,
      "xPos": 860,
      "id": 7
    },
    {
      "description": "This is where we met that elf and kind of Dulc!",
      "yPos": 817,
      "xPos": 1037,
      "id": 8
    },
    {
      "description": "Found the dead mirribar delegation",
      "yPos": 910,
      "xPos": 1030,
      "id": 9
    },
    {
      "description": "Weathervale Knight Tower",
      "yPos": 967,
      "xPos": 840,
      "id": 10
    },
    {
      "description": "Riverguard Keep",
      "yPos": 1002,
      "xPos": 956,
      "id": 11
    },
    {
      "description": "I think this is where the BlackEarth Monastary is. It could be on the other side of the river, but it was dead west from the death of the delegation",
      "yPos": 921,
      "xPos": 948,
      "id": 12
    },
    {
      "description": "Killed the Manticore!",
      "yPos": 924,
      "xPos": 903,
      "id": 13
    },
    {
      "description": "Found a bunch of other dead bodies",
      "yPos": 1017,
      "xPos": 913,
      "id": 14
    }
  ],
  "characters": [
    {"oh-pro":
      {
        "name": "Oh-pro Buffington",
        "portrait": "assets/pics/rimrockknight.jpg",
        "affiliation": "Emerald Enclave",
        "class": "Cleric",
        "likes":[
          "Helping people",
          " Robots"
        ],
        "dislikes":[
            "Evil"
        ]
      },
  
      "the hermit":
      {
      "name": "The Hermit",
      "portrait": "assets/pics/Derangedhermit.jpg",
      "affiliation": "Emerald Enclave",
      "class": "Rogue",
      "likes":[
        "Sitting by himself",
        " Stealing"
      ],
      "dislikes":[
          "Sobriety"
      ]
      },
      "clud":
      {
      "name": "Clud",
      "portrait": "assets/pics/clud2.PNG",
      "affiliation": "unknown",
      "class": "Artificer/Artifact",
      "likes":[
        "Oh-pro Buffington",
        " Eating and drinking"
      ],
      "dislikes":[
          "Oh-pro Buffington",
          " Not being able to taste"
      ]
      },
      "omaric":
      {
      "name": "Omaric",
      "portrait": "assets/pics/omaric.jpg",
      "affiliation": "Himself",
      "class": "Wild Sorcerer",
      "likes":[
        "Not Exploding",
        " Finding meaning in life"
      ],
      "dislikes":[
          "Exploding",
          "  -Ism's he just believes in himself"
      ]
      }
    }
  
  ]
}